import socket
BLUE='\033[34m'
GREEN='\033[32m'
print(BLUE+'''
░███████   ░███    ░██   ░██████      ░█████████  ░██████████   ░██████     ░██████   ░██         ░██    ░██ ░██████████ ░█████████  
░██   ░██  ░████   ░██  ░██   ░██     ░██     ░██ ░██          ░██   ░██   ░██   ░██  ░██         ░██    ░██ ░██         ░██     ░██ 
░██    ░██ ░██░██  ░██ ░██            ░██     ░██ ░██         ░██         ░██     ░██ ░██         ░██    ░██ ░██         ░██     ░██ 
░██    ░██ ░██ ░██ ░██  ░████████     ░█████████  ░█████████   ░████████  ░██     ░██ ░██         ░██    ░██ ░█████████  ░█████████  
░██    ░██ ░██  ░██░██         ░██    ░██   ░██   ░██                 ░██ ░██     ░██ ░██          ░██  ░██  ░██         ░██   ░██   
░██   ░██  ░██   ░████  ░██   ░██     ░██    ░██  ░██          ░██   ░██   ░██   ░██  ░██           ░██░██   ░██         ░██    ░██  
░███████   ░██    ░███   ░██████      ░██     ░██ ░██████████   ░██████     ░██████   ░██████████    ░███    ░██████████ ░██     ░██ 
                                                                                                                                     
                                                                                                                                     
                                                                                                                                      ''')
#print(GREEN+"\n\nEnter the domain: ")
domain=input(GREEN+"Enter your domain: ")
option=input('Tell us whether you want to get IPv4 or IPv6?')
if option=="IPv4":
    ip_address=socket.gethostbyname(domain)
    print(f"The IPv4 address of the {domain} is {ip_address}")
elif option=="IPv6":
    ipv6_address=socket.getaddrinfo(domain,None,family=socket.AF_INET6) #Here we use "None" to tell Python to skip application port details (such https/tcp/ftp) entirely.
    socket_address=ipv6_address[0][4]
    ip_address=socket_address[0]
    print(f"The IPv6 address of the {BLUE}{domain} {GREEN}is {BLUE}{ip_address}")
else:
    print("Invalid Option!")